using UnityEngine;

/*
Мы храним в нём уникальные цвета и хотим иметь механизм для работы с этим.
Необходимо сделать простую реализацию инвентаря которая позволяла бы иметь доступ к этим цветам, возможность их добавлять и удалять другим системам игры.
Дизайнер, не владеющий программированием, должен иметь возможность настраивать какие цвета доступны игроку.
Цвета должны быть уникальными
3. Необходим API позволяющий другим частям игры работать с этим «инвентарём».
4. Содержание должно сохраняться между сессиями.
 */

namespace Services
{
    public class InventoryService : MonoBehaviour
    {

    }
}
