using UnityEngine;

/*
И интерфейс позволяющий игроку цветами манипулировать — так же удалять и добавлять.
Дизайнер, не владеющий программированием, должен иметь возможность настраивать какие цвета доступны игроку.
Цвета должны быть уникальными и содержимое должно сохраняться между сессиями.

Что должно быть в итоге:
1. Проект на Юнити произвольной версии, но чтобы мы могли открыть его в 2017.4.
2. В проекте должен быть интерфейс для манипуляции с «инвентарём».
 */

namespace Managers
{
    public class GameManager : MonoBehaviour
    {

    }
}
